app/controllers/comics_controller.rb

SELECT "comics".* FROM "comics"
---
  def index
    @comics = Comic.all

INSERT INTO "comics" ("nombre", "extension", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Spider-Verse No.1"], ["extension", "http://issuu.com/deoxb39/docs/01_"], ["created_at", "2015-04-26 17:07:30.917690"], ["updated_at", "2015-04-26 17:07:30.917690"]]
---
  def create
    @comic = Comic.new(comic_params)

    respond_to do |format|
      if @comic.save

UPDATE "comics" SET "extension" = ?, "updated_at" = ? WHERE "comics"."id" = ?  [["extension", "0/10674788"], ["updated_at", "2015-04-26 22:18:56.599597"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @comic.update(comic_params)

DELETE FROM "comics" WHERE "comics"."id" = ?  [["id", 2]]
---
  def destroy
    @comic.destroy

SELECT  "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_comic
      @comic = Comic.find(params[:id])