app/controllers/welcome_controller.rb

   def index
    @comics = Comic.all
          @q = params[:q]
  if @q
    @comics = Comic.where("nombre like ?", "%#{@q}%")
---
SELECT "comics".* FROM "comics" WHERE (nombre like '%Civil War No.1%')
SELECT "comics".* FROM "comics" WHERE "comics"."nombre" = ?  [["nombre", "spider-verse"]]